# Replacing a value using 'LOC' Function

In [1]:
import pandas as pd

In [2]:
#creating a dummy dataframe

students_data  = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica','Michael'],
                    'score': [12.5, 9.0, 16.5,8.0, 9.0, 20.0],
                    'attempts': [1, 3, 2, 3, 2, 3],
                    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f']

#Converting into dataframe
df = pd.DataFrame(students_data , index=labels)
df

      name  score  attempts qualify
a     Anuj   12.5         1     yes
b  Bhavana    9.0         3      no
c  Katrina   16.5         2     yes
d     John    8.0         3      no
e  Jessica    9.0         2      no
f  Michael   20.0         3     yes

In [3]:
#let's say we want to locate "d" row and "score" column and change the value "8.0" to "11.5

#using the loc function for the same.

df.loc['d', 'score'] = 11.5
df

      name  score  attempts qualify
a     Anuj   12.5         1     yes
b  Bhavana    9.0         3      no
c  Katrina   16.5         2     yes
d     John   11.5         3      no
e  Jessica    9.0         2      no
f  Michael   20.0         3     yes

*As we can see that the value is replaced, from 8.0 to 11.5*

## ----------------------------------------------------Question 23 Ends -------------------------------------------------------